<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px">

# Pandas Data Munging Full Overview

_Authors: Joseph Nelson (DC)_

---

### Lesson Guide
- [Basics of pandas dataframes](#basics)
    - [Loading data](#loading)
    - [Basic examination of data](#examination)
    - [Selecting columns](#selecting)
    - [Describing the data](#describing)
- [Exercise 1](#exercise-1)
- [Sorting and filtering dataframes](#sorting-filtering)
    - [Filtering](#filtering)
    - [Sorting](#sorting)
- [Exercise 2](#exercise-2)
- [Renaming, adding, and removing columns](#columns)
    - [Renaming columns](#renaming-columns)
    - [Adding columns](#adding-columns)
    - [Removing columns](#removing-columns)
- [Handling missing values](#missing)
    - [Find missing values](#find-missing)
    - [Drop missing values](#drop-missing)
    - [Fill in missing values](#fill-missing)
- [Exercise 3](#exercise-3)
- [Split-apply-combine](#split-apply-combine)
    - [Groupby](#groupby)
    - [Apply and combine](#apply-combine)
- [Exercise 4](#exercise-4)
- [Indexing](#indexing)
    - [Location indexing with .loc](#loc)
    - [Position indexing with .iloc](#iloc)
- [Other frequently used features](#frequent)
    - [Use map functions with replacement dictionaries](#map-dict)
    - [Encode strings as integers with .factorize](#factorize)
    - [Determine unique values](#unique)
    - [Replace values with .replace](#replace)
    - [Series string methods with .str](#series-str)
    - [Datetime conversion and arithmetic](#datetime)
    - [Setting and resetting the index](#set-reset-index)
    - [Sort by index](#sort-by-index)
    - [Change data type of a column](#change-dtype)
    - [Create dummy-coded columns](#dummy)
    - [Concatenate dataframes](#concatenate)
    - [Detect and drop duplicate rows](#duplicate-rows)
    - [Write a dataframe to a csv](#write-csv)
    - [Pickle a dataframe](#pickle)
    - [Randomly sample a dataframe](#sample)
- [Infrequently used features](#infrequent)
    - [Creating dataframes from dictionaries and lists of lists](#toy-dataframes)
    - [Doing cross-tabulations](#crosstab)
    - [Query filtering syntax](#query)
    - [Calculate memory usage](#memory-usage)
    - [Converting column to category type](#category-type)
    - [Creating columns with the assign function](#assign)
    - [Limit number of rows to load on file read](#limit-rows-read)
    - [Manually set number of rows and columns to print](#manual-print)

<a id='basics'></a>

## Reading Files, Selecting Columns, and Summarizing

---

In [1]:
import pandas as pd

<a id='loading'></a>
### Loading data

**Q.1** You can read a file from your local computer or directly from a URL.

In [2]:
# Local:
# pd.read_table('u.user')

# Remote:
users = pd.read_table('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user')

In [3]:
users.head(2)

  user_id|age|gender|occupation|zip_code
0                1|24|M|technician|85711
1                     2|53|F|other|94043

**Q.2** Use kwargs to set appropriate data-reading parameters.

In [4]:
# read 'u.user' into 'users'
users = pd.read_table('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep='|', index_col='user_id')
users.head(2)

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043

<a id='examine'></a>
### Basic examination of dataframes

**Q.1** Print the type of `users`.

In [5]:
type(users)

pandas.core.frame.DataFrame

**Q.2** Print the first 5 rows, first 10 rows, and last 2 rows of `users`.

In [6]:
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [7]:
users.head(10)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

In [8]:
users.tail(2)

         age gender occupation zip_code
user_id
942       48      F  librarian    78209
943       22      M    student    77841

**Q.3** Print the index and columns.

In [10]:
print (users.index[0:5])
print (users.columns)

Int64Index([1, 2, 3, 4, 5], dtype='int64', name='user_id')
Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

**Q.4** Find the dtypes of the columns.

In [11]:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

**Q.5** Find the dimensions of the dataframe.

In [12]:
users.shape

(943, 4)

**Q.6** Extract the underlying numpy array as a new variable.

In [94]:
X = users.values
print (type(X), X.shape)

<class 'numpy.ndarray'> (943, 6)

<a id='selecting'></a>
### Selecting columns

**Q.1** Assign the `gender` column to a variable.

In [ ]:
gender = users['gender']
gender = users.gender

**Q.2** What is the type of `gender`?

In [ ]:
type(gender)

**Q.3** Select `gender` and `occupation` as a new dataframe.

In [14]:
gen_occ = users[['gender','occupation']]

<a id='describing'></a>
### Describing the data

**Q.1** Calculate the descriptive statistics for the numeric columns in the dataframe.

In [15]:
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

**Q.2** Describe the "object" (string) columns.

In [16]:
users.describe(include=['object'])

       gender occupation zip_code
count     943        943      943
unique      2         21      795
top         M    student    55414
freq      670        196        9

**Q.3** Describe all the columns regardless of type.

In [17]:
users.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

**Q.4** Describe the `gender` Series from the `users` dataframe.

In [18]:
users.gender.describe()

count     943
unique      2
top         M
freq      670
Name: gender, dtype: object

**Q.5** Calculate the mean of the `age` column.

In [19]:
users.age.mean()

34.05196182396607

**Q.6** Calculate the counts of distinct values in the gender and age column.

In [20]:
# most useful for categorical variables.
users.gender.value_counts()

M    670
F    273
Name: gender, dtype: int64

In [21]:
# You can also use it on numeric, however:
users.age.value_counts()[0:5]

30    39
25    38
22    37
28    36
27    35
Name: age, dtype: int64

<a id='exercise=1'></a>
## Exercise 1

---

Load the `drinks.csv` data provided in the url below.

**Perform the following:**
1. Print the head and tail.
- Look at the index, columns, dtypes and shape.
- Assign the `beer_servings` column/Series to a variable.
- Calculate summary statistics for `beer_servings`.
- Calculate the median of `beer_servings`.
- Count the values of unique categories in `continent`.
- Print the dimensions of the drinks dataframe.
- Find the first 3 items of the value counts of the `occupation` column.

**BONUS:**
- Create the 'users' DataFrame from the `user_file` provided (which lacks a header row).
- Supply a header: `['user_id', 'age', 'gender', 'occupation', 'zip_code']`

In [22]:
drinks_csv = 'https://raw.githubusercontent.com/josephnelson93/GA-DSI/master/example-lessons/plotting-with-pandas/drinks.csv'
user_file = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user_original'

In [23]:
'''
EXERCISE ONE
'''

# read drinks.csv into a DataFrame called 'drinks'
drinks = pd.read_table('https://raw.githubusercontent.com/josephnelson93/GA-DSI/master/example-lessons/plotting-with-pandas/drinks.csv', sep=',')
drinks = pd.read_csv('https://raw.githubusercontent.com/josephnelson93/GA-DSI/master/example-lessons/plotting-with-pandas/drinks.csv')              # assumes separator is comma

# print the head and the tail
drinks.head()
drinks.tail()

# examine the default index, data types, and shape
drinks.index
drinks.dtypes
drinks.shape

# print the 'beer_servings' Series
drinks['beer_servings']
drinks.beer_servings

# calculate the mean 'beer_servings' for the entire dataset
drinks.describe()                   # summarize all numeric columns
drinks.beer_servings.describe()     # summarize only the 'beer_servings' Series
drinks.beer_servings.mean()         # only calculate the mean

# count the number of occurrences of each 'continent' value and see if it looks correct
drinks.continent.value_counts()

# BONUS: display only the number of rows of the 'users' DataFrame
users.shape[0]

# BONUS: display the 3 most frequent occupations in 'users'
users.occupation.value_counts().head(3)
users.occupation.value_counts()[:3]

# BONUS: create the 'users' DataFrame from the u.user_original file (which lacks a header row)
# Hint: read the pandas.read_table documentation
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users = pd.read_table('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user_original', sep='|', header=None, names=user_cols, index_col='user_id')

<a id='filtering-sorting'></a>

## Filtering and sorting dataframes and series

---

<a id='filtering'></a>
### Boolean filtering

**Q.1** Show users with age < 20 using a boolean mask.

In [24]:
# boolean filtering: only show users with age < 20
young_bool = users.age < 20         # create a Series of booleans...
users[young_bool]                   # ...and use that Series to filter rows

         age gender occupation zip_code
user_id
30         7      M    student    55436
36        19      F    student    93117
52        18      F    student    55105
57        16      M       none    84010
67        17      M    student    60402
...      ...    ...        ...      ...
872       19      F    student    74078
880       13      M    student    83702
887       14      F    student    27249
904       17      F    student    61073
925       18      F   salesman    49036

[77 rows x 4 columns]

**Q.2** Calculate value counts of occupation for users age < 20.

In [25]:
users[users.age < 20]               # or, combine into a single step
users[users.age < 20].occupation    # select one column from the filtered results
users[users.age < 20].occupation.value_counts()     # value_counts of resulting Series

student          64
other             4
none              3
writer            2
entertainment     2
artist            1
salesman          1
Name: occupation, dtype: int64

**Q.3** Print the male users age < 20.

In [26]:
# boolean filtering with multiple conditions
users[(users.age < 20) & (users.gender=='M')]       # ampersand for AND condition

         age gender     occupation zip_code
user_id
30         7      M        student    55436
57        16      M           none    84010
67        17      M        student    60402
68        19      M        student    22904
101       15      M        student    05146
110       19      M        student    77840
142       13      M          other    48118
179       15      M  entertainment    20755
221       19      M        student    20685
246       19      M        student    28734
257       17      M        student    77005
289       11      M           none    94619
291       19      M        student    44106
303       19      M        student    14853
320       19      M        student    24060
347       18      M        student    90210
367       17      M        student    37411
368       18      M        student    92113
375       17      M  entertainment    37777
393       19      M        student    83686
397       17      M        student    27514
425       19      M        student    58644
451       16      M        student    48446
453       18      M        student    06333
461       15      M        student    98102
471       10      M        student    77459
521       19      M        student    02146
528       18      M        student    55104
580       16      M        student    17961
582       17      M        student    93003
592       18      M        student    97520
619       17      M        student    44134
621       17      M        student    60402
624       19      M        student    30067
628       13      M           none    94306
632       18      M        student    55454
700       17      M        student    76309
710       19      M        student    92020
729       19      M        student    56567
747       19      M          other    93612
761       17      M        student    97302
817       19      M        student    60152
851       18      M          other    29646
863       17      M        student    60089
880       13      M        student    83702

**Q.4** Print the users age < 10 or age > 70.

In [27]:
users[(users.age < 10) | (users.age > 70)]          # pipe for OR condition

         age gender occupation zip_code
user_id
30         7      M    student    55436
481       73      M    retired    37771

<a id='sorting'></a>
### Sorting

**Q.1** Return the age column sorted (ascending order)

In [28]:
users.age.sort_values()                   # sort a column

user_id
30      7
471    10
289    11
880    13
609    13
       ..
585    69
767    70
803    70
860    70
481    73
Name: age, Length: 943, dtype: int64

**Q.2** Sort the users dataframe by the age column (ascending).

In [29]:
users.sort_values('age').head()

         age gender occupation zip_code
user_id
30         7      M    student    55436
471       10      M    student    77459
289       11      M       none    94619
880       13      M    student    83702
609       13      F    student    55106

**Q.3** Sort the users dataframe by the age column *descending*.

In [30]:
users.sort_values('age', ascending=False).head()

         age gender     occupation zip_code
user_id
481       73      M        retired    37771
803       70      M  administrator    78212
767       70      M       engineer    00000
860       70      F        retired    48322
585       69      M      librarian    98501

<a id='exercise-2'></a>

## Exercise 2

---

**Using the drinks dataframe from the previous exercise:**
1. Filter drinks to include only European countries.
- Filter drinks to include only European countries with `wine_servings` > 300.
- Calculate the mean `beer_servings` for all of Europe.
- Which 10 countries have the highest `total_litres_of_pure_alcohol`?

**Using the users dataframe:**
1. Sort users by occupation and then by age in a single command.
- Filter users to only include doctors and lawyers without using a `|`

> *Hint:* look up `pandas.Series.isin`

In [31]:
'''
EXERCISE TWO
'''

# filter 'drinks' to only include European countries
drinks[drinks.continent=='EU']

# filter 'drinks' to only include European countries with wine_servings > 300
drinks[(drinks.continent=='EU') & (drinks.wine_servings > 300)]

# calculate the mean 'beer_servings' for all of Europe
drinks[drinks.continent=='EU'].beer_servings.mean()

# determine which 10 countries have the highest total_litres_of_pure_alcohol
drinks.sort_values('total_litres_of_pure_alcohol').tail(10)

# BONUS: sort 'users' by 'occupation' and then by 'age' (in a single command)
users.sort_values(['occupation', 'age'])

# BONUS: filter 'users' to only include doctors and lawyers without using a |
# Hint: read the pandas.Series.isin documentation
users[users.occupation.isin(['doctor', 'lawyer'])].head()

         age gender occupation zip_code
user_id
10        53      M     lawyer    90703
125       30      M     lawyer    22202
126       28      F     lawyer    20015
138       46      M     doctor    53211
161       50      M     lawyer    55104

<a id='columns'></a>

## Renaming, adding, and removing columns

---

<a id='renaming-columns'></a>
### Renaming columns

**Q.1** Rename "beer_servings" to "beer" and "wine_servings" to wine in the drinks dataframe, returning a *new* dataframe.

In [32]:
# rename one or more columns
renamed_drinks = drinks.rename(columns={'beer_servings':'beer', 'wine_servings':'wine'})

**Q.2** Do the same renaming for drinks, but inplace.

In [33]:
drinks.rename(columns={'beer_servings':'beer', 'wine_servings':'wine'}, inplace=True)

**Q.3** Replace the column names of drinks with `['country', 'beer', 'spirit', 'wine', 'liters', 'continent']`

In [34]:
# replace all column names
drink_cols = ['country', 'beer', 'spirit', 'wine', 'liters', 'continent']
drinks.columns = drink_cols

# Side note: you can replace when loading a csv or other file:
# drinks = pd.read_csv('drinks.csv', header=0, names=drink_cols)

<a id='adding-columns'></a>
### Adding columns

**Q.1** Make a "servings" column that is beer + spirit + wine

In [35]:
drinks['servings'] = drinks.beer + drinks.spirit + drinks.wine

**Q.2** Make a "mL" column that is the liters column times 1000.

In [36]:
drinks['mL'] = drinks.liters * 1000

<a id='removing-columns'></a>
### Removing columns

**Q.1** Remove the "mL" column returning a new dataframe.

In [37]:
dropped = drinks.drop('mL', axis=1) # axis=0 for rows, 1 for columns

**Q.2** Remove the "mL" and "servings" columns from drinks inplace.

In [38]:
drinks.drop(['mL', 'servings'], axis=1, inplace=True)   # drop multiple columns

<a id='missing'></a>
## Handling missing values

---

<a id='find-missing'></a>
### Finding missing values

**Q.1** Include missing values of the continent variable in the drinks dataframe when counting unique values.

In [39]:
# missing values are usually excluded by default
drinks.continent.value_counts()              # excludes missing values
drinks.continent.value_counts(dropna=False)  # includes missing values

AF     53
EU     45
AS     44
NaN    23
OC     16
SA     12
Name: continent, dtype: int64

**Q.2** Create a boolean Series representing which values are missing and not missing in continents.

In [40]:
# find missing values in a Series
is_null = drinks.continent.isnull() # True if missing
is_not_null = drinks.continent.notnull() # True if not missing

**Q.3** Subset to rows in drinks where continent is missing and where continent is not missing.

In [41]:
# use a boolean Series to filter DataFrame rows
drinks_continent_null = drinks[drinks.continent.isnull()]   # only show rows where continent is missing
drinks_continent_notnull = drinks[drinks.continent.notnull()]  # only show rows where continent is not missing

**Q.4** [Side note] Calculate the sum of drink *columns* and the sum of *rows*.

In [42]:
# side note: understanding axes
drinks.sum()            # sums "down" the 0 axis (rows)
drinks.sum(axis=0)      # equivalent (since axis=0 is the default)
drinks.sum(axis=1).head()      # sums "across" the 1 axis (columns)

0      0.0
1    279.9
2     39.7
3    707.4
4    324.9
dtype: float64

In [43]:
# side note: adding booleans
# pd.Series([True, False, True])          # create a boolean Series
# pd.Series([True, False, True]).sum()    # converts False to 0 and True to 1

**Q.5** FInd the number of missing values by column in drinks.

In [44]:
# find missing values in a DataFrame
drinks.isnull()             # DataFrame of booleans
drinks.isnull().sum()       # count the missing values in each column

country       0
beer          0
spirit        0
wine          0
liters        0
continent    23
dtype: int64

<a id='drop-missing'></a>
### Dropping missing values

**Q.1** Drop rows where *ANY* values are missing in drinks (return new dataframe)

In [46]:
print (drinks.shape)
d = drinks.dropna()
print (d.shape)

(193, 6)
(170, 6)

**Q.2** Drop rows only where *ALL* values are missing in drinks.

In [47]:
print (drinks.shape)
d = drinks.dropna(how='all')
print (d.shape)

(193, 6)
(193, 6)

<a id='fill-missing'></a>
### Fill in missing values

**Q.1** Fill in the missing values of the continent column with string "NA"

In [48]:
# fill in missing values
drinks.continent.fillna(value='NA', inplace=True)   # fill in missing values with 'NA'

**Q.2** Turn off the missing value filter when loading the drinks csv.

In [49]:
# turn off the missing value filter
drinks = pd.read_csv(drinks_csv, header=0, names=drink_cols, na_filter=False)

<a id='exercise-3'></a>
## Exercise 3

---

**Using the ufo data provided below:**
1. Read in the data.
- Check the shape and describe the columns.
- Find the four most reported colors.
- Find the most frequent city for reports in state VA.
- Find only UFO reports from Arlington, VA
- Find the number of missing values in each column.
- Show only UFO reporst where city is missing
- Count the number of rows with no null values.
- Replace column names with spaces to have underscores.
- Make a new column that is a combination of city and state.

In [50]:
ufo_csv = 'https://raw.githubusercontent.com/josephofiowa/DAT8/master/data/ufo.csv'

In [51]:
'''
EXERCISE THREE
'''

# read ufo.csv into a DataFrame called 'ufo'
ufo = pd.read_table('https://raw.githubusercontent.com/josephofiowa/DAT8/master/data/ufo.csv', sep=',')
ufo = pd.read_csv('https://raw.githubusercontent.com/josephofiowa/DAT8/master/data/ufo.csv')

# check the shape of the DataFrame
ufo.shape

# calculate the most frequent value for each of the columns (in a single command)
ufo.describe()

# what are the four most frequent colors reported?
ufo['Colors Reported'].value_counts().head(4)

# for reports in VA, what's the most frequent city?
ufo[ufo.State=='VA'].City.value_counts().head(1)

# show only the UFO reports from Arlington, VA
ufo[(ufo.City=='Arlington') & (ufo.State=='VA')]

# count the number of missing values in each column
ufo.isnull().sum()

# show only the UFO reports in which the City is missing
ufo[ufo.City.isnull()]

# how many rows remain if you drop all rows with any missing values?
ufo.dropna().shape[0]

# replace any spaces in the column names with an underscore
ufo.rename(columns={'Colors Reported':'Colors_Reported', 'Shape Reported':'Shape_Reported'}, inplace=True)

# BONUS: redo the task above, writing generic code to replace spaces with underscores
# In other words, your code should not reference the specific column names
ufo.columns = [col.replace(' ', '_') for col in ufo.columns]
ufo.columns = ufo.columns.str.replace(' ', '_')

# Create a new column called 'Location' that includes both City and State
# For example, the 'Location' for the first row would be 'Ithaca, NY'
ufo['Location'] = ufo.City + ', ' + ufo.State

<a id='split-apply-combine'></a>
## Split-apply-combine

---

![](http://i.imgur.com/yjNkiwL.png)

<a id='groupby'></a>
### Grouping

**Q.1** With the drinks dataframe, calculate the mean bear servings by continent.

In [52]:
# for each continent, calculate the mean beer servings
drinks.groupby('continent').beer.mean()

continent
AF     61.471698
AS     37.045455
EU    193.777778
NA    145.434783
OC     89.687500
SA    175.083333
Name: beer, dtype: float64

**Q.2** Describe the beer column by continent.

In [53]:
# for each continent, describe beer servings
drinks.groupby('continent').beer.describe()

           count        mean        std   min     25%    50%     75%    max
continent
AF          53.0   61.471698  80.557816   0.0   15.00   32.0   76.00  376.0
AS          44.0   37.045455  49.469725   0.0    4.25   17.5   60.50  247.0
EU          45.0  193.777778  99.631569   0.0  127.00  219.0  270.00  361.0
NA          23.0  145.434783  79.621163   1.0   80.00  143.0  198.00  285.0
OC          16.0   89.687500  96.641412   0.0   21.00   52.5  125.75  306.0
SA          12.0  175.083333  65.242845  93.0  129.50  162.5  198.00  333.0

<a id='apply-combine'></a>
### Apply functions to groups and combine

**Q.1** Find the count, mean, minimum, and maximum of the beer column by continent.

In [54]:
# similar, but outputs a DataFrame and can be customized
drinks.groupby('continent').beer.agg(['count', 'mean', 'min', 'max'])

           count        mean  min  max
continent
AF            53   61.471698    0  376
AS            44   37.045455    0  247
EU            45  193.777778    0  361
NA            23  145.434783    1  285
OC            16   89.687500    0  306
SA            12  175.083333   93  333

**Q.2** Do the same as in Q.1, but sort the output by the mean column.

In [55]:
drinks.groupby('continent').beer.agg(['count', 'mean', 'min', 'max']).sort_values('mean')

           count        mean  min  max
continent
AS            44   37.045455    0  247
AF            53   61.471698    0  376
OC            16   89.687500    0  306
NA            23  145.434783    1  285
SA            12  175.083333   93  333
EU            45  193.777778    0  361

**Q.3** Apply a custom function to all the columns of the drinks dataframe, grouped by continent.

In [56]:
# first value of each column by continent:
drinks.groupby('continent').apply(lambda x: x.iloc[0,:])

                     country  beer  spirit  wine  liters continent
continent
AF                   Algeria    25       0    14     0.7        AF
AS               Afghanistan     0       0     0     0.0        AS
EU                   Albania    89     132    54     4.9        EU
NA         Antigua & Barbuda   102     128    45     4.9        NA
OC                 Australia   261      72   212    10.4        OC
SA                 Argentina   193      25   221     8.3        SA

**Q.4** [Note] If you don't specify a column for the aggregation function, it will be applied to all numeric columns.

In [57]:
drinks.groupby('continent').mean()
drinks.groupby('continent').describe()

           beer                                                             \
          count        mean        std   min     25%    50%     75%    max
continent
AF         53.0   61.471698  80.557816   0.0   15.00   32.0   76.00  376.0
AS         44.0   37.045455  49.469725   0.0    4.25   17.5   60.50  247.0
EU         45.0  193.777778  99.631569   0.0  127.00  219.0  270.00  361.0
NA         23.0  145.434783  79.621163   1.0   80.00  143.0  198.00  285.0
OC         16.0   89.687500  96.641412   0.0   21.00   52.5  125.75  306.0
SA         12.0  175.083333  65.242845  93.0  129.50  162.5  198.00  333.0

          spirit              ...    wine        liters                      \
           count        mean  ...     75%    max  count      mean       std
continent                     ...
AF          53.0   16.339623  ...   13.00  233.0   53.0  3.007547  2.647557
AS          44.0   60.840909  ...    8.00  123.0   44.0  2.170455  2.770239
EU          45.0  132.555556  ...  195.00  370.0   45.0  8.617778  3.358455
NA          23.0  165.739130  ...   34.00  100.0   23.0  5.995652  2.409353
OC          16.0   58.437500  ...   23.25  212.0   16.0  3.381250  3.345688
SA          12.0  114.750000  ...   98.50  221.0   12.0  6.308333  1.531166


           min   25%    50%     75%   max
continent
AF         0.0  0.70   2.30   4.700   9.1
AS         0.0  0.10   1.20   2.425  11.5
EU         0.0  6.60  10.00  10.900  14.4
NA         2.2  4.30   6.30   7.000  11.9
OC         0.0  1.00   1.75   6.150  10.4
SA         3.8  5.25   6.85   7.375   8.3

[6 rows x 32 columns]

<a id='exercise-4'></a>

## Exercise 4

---

**Using the users dataframe**:
1. Count the number of distinct occupations in users.
- Calculate the mean age by occupation.
- Calculate the minimum and maximum age by occupation.
- Calculate the mean age by cross-sections of occupation and gender.

> *Tip: multiple columns can be passed to the groupby function for granular cross-sections.*

In [58]:
'''
EXERCISE FOUR
'''

# for each occupation in 'users', count the number of occurrences
users.occupation.value_counts()

# for each occupation, calculate the mean age
users.groupby('occupation').age.mean()

# For each occupation, calculate the minimum and maximum ages
users.groupby('occupation').age.agg(['min', 'max'])

# For each combination of occupation and gender, calculate the mean age
users.groupby(['occupation', 'gender']).age.mean()

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

<a id='indexing'></a>
## Indexing

---

<a id='loc'></a>
### Label indexing with `.loc`

**Q.1** Select all rows and the "City" column from the ufo dataset with `.loc`.

In [59]:
d = ufo.loc[:, 'City'] # colon means "all rows", then select one column

**Q.2** Select all rows and columns "City" and "State"

In [60]:
d = ufo.loc[:, ['City', 'State']]   # select two columns

**Q.3** Select all rows and columns from "City" *through* "State"

In [61]:
d = ufo.loc[:, 'City':'State'] # select a range of columns
d.columns

Index(['City', 'Colors_Reported', 'Shape_Reported', 'State'], dtype='object')

**Q.4** Select:
- all columns at row 0
- all columns at rows 0:2
- columns "City" through "State" at rows 0:2

In [62]:
# loc can also filter rows by "name" (the index)
d = ufo.loc[0, :]                   # row 0, all columns
d = ufo.loc[0:2, :]                 # rows 0/1/2, all columns
d = ufo.loc[0:2, 'City':'State']    # rows 0/1/2, range of columns

<a id='iloc'></a>
### Position indexing with `.iloc`

**Q.1** Select all rows and columns in position 0 and 3.

In [63]:
d = ufo.iloc[:, [0, 3]] # all rows, columns in position 0/3

**Q.2** Select all rows and columns 0 through 4.

In [64]:
d = ufo.iloc[:, 0:4] # all rows, columns in position 0/1/2/3

**Q.3** Select rows in position 0:3 and all columns.

In [65]:
d = ufo.iloc[0:3, :] # rows in position 0/1/2, all columns

<a id='frequent'></a>
## Frequently used features

---

<a id='map-dict'></a>
### The `.map` function with replacement dictionaries

In [66]:
# map existing values to a different set of values
users['is_male'] = users.gender.map({'F':0, 'M':1})

<a id='factorize'></a>
### Encode strings as integers with `.factorize`

In [67]:
# encode strings as integer values (automatically starts at 0)
users['occupation_num'] = users.occupation.factorize()[0]

users.head()

         age gender  occupation zip_code  is_male  occupation_num
user_id
1         24      M  technician    85711        1               0
2         53      F       other    94043        0               1
3         23      M      writer    32067        1               2
4         24      M  technician    43537        1               0
5         33      F       other    15213        0               1

<a id='unique'></a>
### Determine unique values

In [68]:
# determine unique values in a column
users.occupation.nunique()      # count the number of unique values

21

In [69]:
users.occupation.unique()       # return the unique values

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

<a id='replace'></a>
### Replace values with `.replace`

In [70]:
# replace all instances of a value in a column (must match entire value)
ufo.State.replace('Fl', 'FL', inplace=True)

<a id='series-str'></a>
### Series string methods with `.str`

In [71]:
# string methods are accessed via 'str'
ufo.State.str.upper()                               # converts to uppercase
ufo.Colors_Reported.str.contains('RED', na='False').head(2) # checks for a substring

0    False
1    False
Name: Colors_Reported, dtype: object

<a id='datetime'></a>
### `datetime` conversion and arithmetic

In [93]:
# convert a string to the datetime format
ufo['Time'] = pd.to_datetime(ufo.Time)
ufo.Time.dt.hour                        # datetime format exposes convenient attributes
(ufo.Time.max() - ufo.Time.min()).days  # also allows you to do datetime "math"
ufo[ufo.Time > '01-01-2014'].head(2) # boolean filtering with datetime format

,Time,City,Colors_Reported,Shape_Reported,State,Location
75177,2014-01-01 00:01:00,Clarksville,ORANGE,SPHERE,TN,"Clarksville, TN"
75178,2014-01-01 00:01:00,Henderson,NaN,SPHERE,NV,"Henderson, NV"

<a id='set-reset-index'></a>
### Setting and resetting the index

In [73]:
# setting and then removing an index
ufo.set_index('Time', inplace=True)
ufo.reset_index(inplace=True)

<a id='sort-by-index'></a>
### Sorting by the index

In [74]:
# sort a column by its index
ufo.State.value_counts().sort_index()[0:3]

AK    403
AL    808
AR    748
Name: State, dtype: int64

<a id='change-dtype'></a>
### Changing the data type of a column

In [75]:
# change the data type of a column
drinks['beer'] = drinks.beer.astype('float')

# change the data type of a column when reading in a file
d = pd.read_csv(drinks_csv, dtype={'beer_servings':float})

<a id='dummy'></a>
### Create dummy-coded columns from a categorical column

In [76]:
# create dummy variables for 'continent' and exclude first dummy column
continent_dummies = pd.get_dummies(drinks.continent, prefix='cont').iloc[:, 1:]
continent_dummies.head(3)

   cont_AS  cont_EU  cont_NA  cont_OC  cont_SA
0        1        0        0        0        0
1        0        1        0        0        0
2        0        0        0        0        0

<a id='concatenate'></a>
### Concatenate dataframes together

In [77]:
# concatenate two DataFrames (axis=0 for rows, axis=1 for columns)
drinks = pd.concat([drinks, continent_dummies], axis=1)

In [78]:
drinks.head(2)

,country,beer,spirit,wine,liters,continent,cont_AS,cont_EU,cont_NA,cont_OC,cont_SA
0,Afghanistan,0.0,0,0,0.0,AS,1,0,0,0,0
1,Albania,89.0,132,54,4.9,EU,0,1,0,0,0

<a id='duplicate-rows'></a>
### Detect and drop duplicate rows

In [79]:
# detecting duplicate rows
d = users.duplicated()          # True if a row is identical to a previous row
d = users.duplicated().sum()    # count of duplicates
d = users[users.duplicated()]   # only show duplicates
d = users.drop_duplicates()     # drop duplicate rows
d = users.age.duplicated()      # check a single column for duplicates
d = users.duplicated(['age', 'gender', 'zip_code']).sum()   # specify columns for finding duplicates

<a id='write-csv'></a>
### Write a dataframe to a csv

In [80]:
# write a DataFrame out to a CSV
# drinks.to_csv('drinks_updated.csv')                 # index is used as first column
# drinks.to_csv('drinks_updated.csv', index=False)    # ignore index

<a id='pickle'></a>
### Write a dataframe to a pickle object

In [81]:
# save a DataFrame to disk (aka 'pickle') and read it from disk (aka 'unpickle')
# drinks.to_pickle('drinks_pickle')
# pd.read_pickle('drinks_pickle')

<a id='sample'></a>
### Randomly sample a dataframe

In [82]:
# randomly sample a DataFrame
train = drinks.sample(frac=0.75, random_state=1)    # will contain 75% of the rows
test = drinks[~drinks.index.isin(train.index)]      # will contain the other 25%

<a id='infrequent'></a>
## Infrequently used features

---

<a id='toy-dataframes'></a>
### Create dataframes from dictionaries and lists of lists

In [83]:
# create a DataFrame from a dictionary
d = pd.DataFrame({'capital':['Montgomery', 'Juneau', 'Phoenix'], 'state':['AL', 'AK', 'AZ']})

# create a DataFrame from a list of lists
d = pd.DataFrame([['Montgomery', 'AL'], ['Juneau', 'AK'], ['Phoenix', 'AZ']], columns=['capital', 'state'])

<a id='crosstab'></a>
### Do a cross-tabulation between Series

In [84]:
# display a cross-tabulation of two Series
pd.crosstab(users.occupation, users.gender)

gender          F    M
occupation
administrator  36   43
artist         13   15
doctor          0    7
educator       26   69
engineer        2   65
entertainment   2   16
executive       3   29
healthcare     11    5
homemaker       6    1
lawyer          2   10
librarian      29   22
marketing      10   16
none            4    5
other          36   69
programmer      6   60
retired         1   13
salesman        3    9
scientist       3   28
student        60  136
technician      1   26
writer         19   26

<a id='query'></a>
### Query syntax for filtering

In [85]:
# alternative syntax for boolean filtering (noted as "experimental" in the documentation)
d = users.query('age < 20')                 # users[users.age < 20]
d = users.query("age < 20 and gender=='M'") # users[(users.age < 20) & (users.gender=='M')]
d = users.query('age < 20 or age > 60')     # users[(users.age < 20) | (users.age > 60)]

<a id='memory-usage'></a>
### Calculate memory usage

In [86]:
# display the memory usage of a DataFrame
d = ufo.info()          # total usage
ufo.memory_usage()  # usage by column

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80543 entries, 0 to 80542
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Time             80543 non-null  datetime64[ns]
 1   City             80496 non-null  object
 2   Colors_Reported  17034 non-null  object
 3   Shape_Reported   72141 non-null  object
 4   State            80543 non-null  object
 5   Location         80496 non-null  object
dtypes: datetime64[ns](1), object(5)
memory usage: 3.7+ MB

Index                 128
Time               644344
City               644344
Colors_Reported    644344
Shape_Reported     644344
State              644344
Location           644344
dtype: int64

<a id='category-type'></a>
### Convert a column to type 'category'

In [87]:
# change a Series to the 'category' data type (reduces memory usage and increases performance)
ufo['State'] = ufo.State.astype('category')

<a id='assign'></a>
### Define column with `.assign`

In [88]:
# temporarily define a new column as a function of existing columns
drinks.assign(servings = drinks.beer + drinks.spirit + drinks.wine).head(2)

,country,beer,spirit,wine,liters,continent,cont_AS,cont_EU,cont_NA,cont_OC,cont_SA,servings
0,Afghanistan,0.0,0,0,0.0,AS,1,0,0,0,0,0.0
1,Albania,89.0,132,54,4.9,EU,0,1,0,0,0,275.0

<a id='limit-rows-read'></a>
### Limit rows when reading a file

In [89]:
# limit which rows are read when reading in a file
d = pd.read_csv(drinks_csv, nrows=10)           # only read first 10 rows
d = pd.read_csv(drinks_csv, skiprows=[1, 2])    # skip the first two rows of data

<a id='manual-print'></a>
### Manually set maximum rows and columns to print

In [90]:
# change the maximum number of rows and columns printed ('None' means unlimited)
pd.set_option('max_rows', 2)     # default is 60 rows
pd.set_option('max_columns', 2)  # default is 20 columns
print (drinks)

         country  ...  cont_SA
0    Afghanistan  ...        0
..           ...  ...      ...
192     Zimbabwe  ...        0

[193 rows x 11 columns]

In [91]:
# reset options to defaults
pd.reset_option('max_rows')
pd.reset_option('max_columns')

In [92]:
# change the options temporarily (settings are restored when you exit the 'with' block)
with pd.option_context('max_rows', None, 'max_columns', None):
    print (drinks)

                          country   beer  spirit  wine  liters continent  \
0                     Afghanistan    0.0       0     0     0.0        AS
1                         Albania   89.0     132    54     4.9        EU
2                         Algeria   25.0       0    14     0.7        AF
3                         Andorra  245.0     138   312    12.4        EU
4                          Angola  217.0      57    45     5.9        AF
5               Antigua & Barbuda  102.0     128    45     4.9        NA
6                       Argentina  193.0      25   221     8.3        SA
7                         Armenia   21.0     179    11     3.8        EU
8                       Australia  261.0      72   212    10.4        OC
9                         Austria  279.0      75   191     9.7        EU
10                     Azerbaijan   21.0      46     5     1.3        EU
11                        Bahamas  122.0     176    51     6.3        NA
12                        Bahrain   42.0      63     7     2.0        AS
13                     Bangladesh    0.0       0     0     0.0        AS
14                       Barbados  143.0     173    36     6.3        NA
15                        Belarus  142.0     373    42    14.4        EU
16                        Belgium  295.0      84   212    10.5        EU
17                         Belize  263.0     114     8     6.8        NA
18                          Benin   34.0       4    13     1.1        AF
19                         Bhutan   23.0       0     0     0.4        AS
20                        Bolivia  167.0      41     8     3.8        SA
21             Bosnia-Herzegovina   76.0     173     8     4.6        EU
22                       Botswana  173.0      35    35     5.4        AF
23                         Brazil  245.0     145    16     7.2        SA
24                         Brunei   31.0       2     1     0.6        AS
25                       Bulgaria  231.0     252    94    10.3        EU
26                   Burkina Faso   25.0       7     7     4.3        AF
27                        Burundi   88.0       0     0     6.3        AF
28                  Cote d'Ivoire   37.0       1     7     4.0        AF
29                     Cabo Verde  144.0      56    16     4.0        AF
30                       Cambodia   57.0      65     1     2.2        AS
31                       Cameroon  147.0       1     4     5.8        AF
32                         Canada  240.0     122   100     8.2        NA
33       Central African Republic   17.0       2     1     1.8        AF
34                           Chad   15.0       1     1     0.4        AF
35                          Chile  130.0     124   172     7.6        SA
36                          China   79.0     192     8     5.0        AS
37                       Colombia  159.0      76     3     4.2        SA
38                        Comoros    1.0       3     1     0.1        AF
39                          Congo   76.0       1     9     1.7        AF
40                   Cook Islands    0.0     254    74     5.9        OC
41                     Costa Rica  149.0      87    11     4.4        NA
42                        Croatia  230.0      87   254    10.2        EU
43                           Cuba   93.0     137     5     4.2        NA
44                         Cyprus  192.0     154   113     8.2        EU
45                 Czech Republic  361.0     170   134    11.8        EU
46                    North Korea    0.0       0     0     0.0        AS
47                       DR Congo   32.0       3     1     2.3        AF
48                        Denmark  224.0      81   278    10.4        EU
49                       Djibouti   15.0      44     3     1.1        AF
50                       Dominica   52.0     286    26     6.6        NA
51             Dominican Republic  193.0     147     9     6.2        NA
52                        Ecuador  162.0      74     3     4.2        SA
53                          Egypt    6.0       4     1     0.2        AF
54                    El Salvador   52.0      69     2     2.2        NA
55              Equatorial Guinea   92.0       0   233     5.8        AF
56                        Eritrea   18.0       0     0     0.5        AF
57                        Estonia  224.0     194    59     9.5        EU
58                       Ethiopia   20.0       3     0     0.7        AF
59                           Fiji   77.0      35     1     2.0        OC
60                        Finland  263.0     133    97    10.0        EU
61                         France  127.0     151   370    11.8        EU
62                          Gabon  347.0      98    59     8.9        AF
63                         Gambia    8.0       0     1     2.4        AF
64                        Georgia   52.0     100   149     5.4        EU
65                        Germany  346.0     117   175    11.3        EU
66                          Ghana   31.0       3    10     1.8        AF
67                         Greece  133.0     112   218     8.3        EU
68                        Grenada  199.0     438    28    11.9        NA
69                      Guatemala   53.0      69     2     2.2        NA
70                         Guinea    9.0       0     2     0.2        AF
71                  Guinea-Bissau   28.0      31    21     2.5        AF
72                         Guyana   93.0     302     1     7.1        SA
73                          Haiti    1.0     326     1     5.9        NA
74                       Honduras   69.0      98     2     3.0        NA
75                        Hungary  234.0     215   185    11.3        EU
76                        Iceland  233.0      61    78     6.6        EU
77                          India    9.0     114     0     2.2        AS
78                      Indonesia    5.0       1     0     0.1        AS
79                           Iran    0.0       0     0     0.0        AS
80                           Iraq    9.0       3     0     0.2        AS
81                        Ireland  313.0     118   165    11.4        EU
82                         Israel   63.0      69     9     2.5        AS
83                          Italy   85.0      42   237     6.5        EU
84                        Jamaica   82.0      97     9     3.4        NA
85                          Japan   77.0     202    16     7.0        AS
86                         Jordan    6.0      21     1     0.5        AS
87                     Kazakhstan  124.0     246    12     6.8        AS
88                          Kenya   58.0      22     2     1.8        AF
89                       Kiribati   21.0      34     1     1.0        OC
90                         Kuwait    0.0       0     0     0.0        AS
91                     Kyrgyzstan   31.0      97     6     2.4        AS
92                           Laos   62.0       0   123     6.2        AS
93                         Latvia  281.0     216    62    10.5        EU
94                        Lebanon   20.0      55    31     1.9        AS
95                        Lesotho   82.0      29     0     2.8        AF
96                        Liberia   19.0     152     2     3.1        AF
97                          Libya    0.0       0     0     0.0        AF
98                      Lithuania  343.0     244    56    12.9        EU
99                     Luxembourg  236.0     133   271    11.4        EU
100                    Madagascar   26.0      15     4     0.8        AF
101                        Malawi    8.0      11     1     1.5        AF
102                      Malaysia   13.0       4     0     0.3        AS
103                      Maldives    0.0       0     0     0.0        AS
104                          Mali    5.0       1     1     0.6        AF
105                         Malta  149.0     100   120     6.6        EU
106              Marshall Islands    0.0       0     0     0.0        OC
107                    Mauritania    0.0       0     0     0.0        AF
108                     Mauritius   98.0      31    18     2.6        AF
109                        Mexico  238.0      68     5     5.5        NA
110                    Micronesia   62.0      50    18     2.3        OC
111                        Monaco    0.0       0     0     0.0        EU
112                      Mongolia   77.0     189     8     4.9        AS
113                    Montenegro   31.0     114   128     4.9        EU
114                       Morocco   12.0       6    10     0.5        AF
115                    Mozambique   47.0      18     5     1.3        AF
116                       Myanmar    5.0       1     0     0.1        AS
117                       Namibia  376.0       3     1     6.8        AF
118                         Nauru   49.0       0     8     1.0        OC
119                         Nepal    5.0       6     0     0.2        AS
120                   Netherlands  251.0      88   190     9.4        EU
121                   New Zealand  203.0      79   175     9.3        OC
122                     Nicaragua   78.0     118     1     3.5        NA
123                         Niger    3.0       2     1     0.1        AF
124                       Nigeria   42.0       5     2     9.1        AF
125                          Niue  188.0     200     7     7.0        OC
126                        Norway  169.0      71   129     6.7        EU
127                          Oman   22.0      16     1     0.7        AS
128                      Pakistan    0.0       0     0     0.0        AS
129                         Palau  306.0      63    23     6.9        OC
130                        Panama  285.0     104    18     7.2        NA
131              Papua New Guinea   44.0      39     1     1.5        OC
132                      Paraguay  213.0     117    74     7.3        SA
133                          Peru  163.0     160    21     6.1        SA
134                   Philippines   71.0     186     1     4.6        AS
135                        Poland  343.0     215    56    10.9        EU
136                      Portugal  194.0      67   339    11.0        EU
137                         Qatar    1.0      42     7     0.9        AS
138                   South Korea  140.0      16     9     9.8        AS
139                       Moldova  109.0     226    18     6.3        EU
140                       Romania  297.0     122   167    10.4        EU
141            Russian Federation  247.0     326    73    11.5        AS
142                        Rwanda   43.0       2     0     6.8        AF
143             St. Kitts & Nevis  194.0     205    32     7.7        NA
144                     St. Lucia  171.0     315    71    10.1        NA
145  St. Vincent & the Grenadines  120.0     221    11     6.3        NA
146                         Samoa  105.0      18    24     2.6        OC
147                    San Marino    0.0       0     0     0.0        EU
148           Sao Tome & Principe   56.0      38   140     4.2        AF
149                  Saudi Arabia    0.0       5     0     0.1        AS
150                       Senegal    9.0       1     7     0.3        AF
151                        Serbia  283.0     131   127     9.6        EU
152                    Seychelles  157.0      25    51     4.1        AF
153                  Sierra Leone   25.0       3     2     6.7        AF
154                     Singapore   60.0      12    11     1.5        AS
155                      Slovakia  196.0     293   116    11.4        EU
156                      Slovenia  270.0      51   276    10.6        EU
157               Solomon Islands   56.0      11     1     1.2        OC
158                       Somalia    0.0       0     0     0.0        AF
159                  South Africa  225.0      76    81     8.2        AF
160                         Spain  284.0     157   112    10.0        EU
161                     Sri Lanka   16.0     104     0     2.2        AS
162                         Sudan    8.0      13     0     1.7        AF
163                      Suriname  128.0     178     7     5.6        SA
164                     Swaziland   90.0       2     2     4.7        AF
165                        Sweden  152.0      60   186     7.2        EU
166                   Switzerland  185.0     100   280    10.2        EU
167                         Syria    5.0      35    16     1.0        AS
168                    Tajikistan    2.0      15     0     0.3        AS
169                      Thailand   99.0     258     1     6.4        AS
170                     Macedonia  106.0      27    86     3.9        EU
171                   Timor-Leste    1.0       1     4     0.1        AS
172                          Togo   36.0       2    19     1.3        AF
173                         Tonga   36.0      21     5     1.1        OC
174             Trinidad & Tobago  197.0     156     7     6.4        NA
175                       Tunisia   51.0       3    20     1.3        AF
176                        Turkey   51.0      22     7     1.4        AS
177                  Turkmenistan   19.0      71    32     2.2        AS
178                        Tuvalu    6.0      41     9     1.0        OC
179                        Uganda   45.0       9     0     8.3        AF
180                       Ukraine  206.0     237    45     8.9        EU
181          United Arab Emirates   16.0     135     5     2.8        AS
182                United Kingdom  219.0     126   195    10.4        EU
183                      Tanzania   36.0       6     1     5.7        AF
184                           USA  249.0     158    84     8.7        NA
185                       Uruguay  115.0      35   220     6.6        SA
186                    Uzbekistan   25.0     101     8     2.4        AS
187                       Vanuatu   21.0      18    11     0.9        OC
188                     Venezuela  333.0     100     3     7.7        SA
189                       Vietnam  111.0       2     1     2.0        AS
190                         Yemen    6.0       0     0     0.1        AS
191                        Zambia   32.0      19     4     2.5        AF
192                      Zimbabwe   64.0      18     4     4.7        AF

     cont_AS  cont_EU  cont_NA  cont_OC  cont_SA
0          1        0        0        0        0
1          0        1        0        0        0
2          0        0        0        0        0
3          0        1        0        0        0
4          0        0        0        0        0
5          0        0        1        0        0
6          0        0        0        0        1
7          0        1        0        0        0
8          0        0        0        1        0
9          0        1        0        0        0
10         0        1        0        0        0
11         0        0        1        0        0
12         1        0        0        0        0
13         1        0        0        0        0
14         0        0        1        0        0
15         0        1        0        0        0
16         0        1        0        0        0
17         0        0        1        0        0
18         0        0        0        0        0
19         1        0        0        0        0
20         0        0        0        0        1
21         0        1        0        0        0
22         0        0        0        0        0
23         0        0        0        0        1
24         1        0        0        0        0
25         0        1        0        0        0
26         0        0        0        0        0
27         0        0        0        0        0
28         0        0        0        0        0
29         0        0        0        0        0
30         1        0        0        0        0
31         0        0        0        0        0
32         0        0        1        0        0
33         0        0        0        0        0
34         0        0        0        0        0
35         0        0        0        0        1
36         1        0        0        0        0
37         0        0        0        0        1
38         0        0        0        0        0
39         0        0        0        0        0
40         0        0        0        1        0
41         0        0        1        0        0
42         0        1        0        0        0
43         0        0        1        0        0
44         0        1        0        0        0
45         0        1        0        0        0
46         1        0        0        0        0
47         0        0        0        0        0
48         0        1        0        0        0
49         0        0        0        0        0
50         0        0        1        0        0
51         0        0        1        0        0
52         0        0        0        0        1
53         0        0        0        0        0
54         0        0        1        0        0
55         0        0        0        0        0
56         0        0        0        0        0
57         0        1        0        0        0
58         0        0        0        0        0
59         0        0        0        1        0
60         0        1        0        0        0
61         0        1        0        0        0
62         0        0        0        0        0
63         0        0        0        0        0
64         0        1        0        0        0
65         0        1        0        0        0
66         0        0        0        0        0
67         0        1        0        0        0
68         0        0        1        0        0
69         0        0        1        0        0
70         0        0        0        0        0
71         0        0        0        0        0
72         0        0        0        0        1
73         0        0        1        0        0
74         0        0        1        0        0
75         0        1        0        0        0
76         0        1        0        0        0
77         1        0        0        0        0
78         1        0        0        0        0
79         1        0        0        0        0
80         1        0        0        0        0
81         0        1        0        0        0
82         1        0        0        0        0
83         0        1        0        0        0
84         0        0        1        0        0
85         1        0        0        0        0
86         1        0        0        0        0
87         1        0        0        0        0
88         0        0        0        0        0
89         0        0        0        1        0
90         1        0        0        0        0
91         1        0        0        0        0
92         1        0        0        0        0
93         0        1        0        0        0
94         1        0        0        0        0
95         0        0        0        0        0
96         0        0        0        0        0
97         0        0        0        0        0
98         0        1        0        0        0
99         0        1        0        0        0
100        0        0        0        0        0
101        0        0        0        0        0
102        1        0        0        0        0
103        1        0        0        0        0
104        0        0        0        0        0
105        0        1        0        0        0
106        0        0        0        1        0
107        0        0        0        0        0
108        0        0        0        0        0
109        0        0        1        0        0
110        0        0        0        1        0
111        0        1        0        0        0
112        1        0        0        0        0
113        0        1        0        0        0
114        0        0        0        0        0
115        0        0        0        0        0
116        1        0        0        0        0
117        0        0        0        0        0